{"format": "graph-model", "generatedBy": "2.19.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"waveform": {"name": "waveform:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3360"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "6"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/zeros_like", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/ones_like", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/floordiv_3/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/concat_1/values_1/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/range_1/start", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/range_1/delta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/floordiv_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/Reshape_2/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/Reshape_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/Reshape/shape_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame_step", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame_length", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/packed", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/concat_2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/hann_window/sub_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/rfft/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/rfft/fft_length", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "257"}, {"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/conv1_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/conv1_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/bn1_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/bn1_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/conv2_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/conv2_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/bn2_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/bn2_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/conv3_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/conv3_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/bn3_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/bn3_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/gap_1/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/dense1_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/dense1_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/vowel_output_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/vowel_output_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "waveform", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "3360"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/Shape", "op": "Shape", "input": ["waveform"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/split", "op": "SplitV", "input": ["StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/Shape", "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/packed", "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/split/split_dim"], "attr": {"num_split": {"i": "3"}, "T": {"type": "DT_INT32"}, "Tlen": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/split:1", "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/Reshape/shape_1"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/floordiv_3", "op": "FloorDiv", "input": ["StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/Reshape", "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/floordiv_3/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/sub_2", "op": "Sub", "input": ["StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/Reshape", "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame_length"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/mul", "op": "Mul", "input": ["StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/floordiv_3", "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/concat_1/values_1", "op": "Pack", "input": ["StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/floordiv_3", "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/concat_1/values_1/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/floordiv", "op": "FloorDiv", "input": ["StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/sub_2", "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame_step"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/concat/values_1_const_axis", "op": "Const", "input": ["^StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/mul"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/split", "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/concat_1/values_1", "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/split:2", "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/concat_1/axis"], "attr": {"N": {"i": "3"}, "T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/add", "op": "AddV2", "input": ["StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/add/x", "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/floordiv"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/concat/values_1", "op": "ExpandDims", "input": ["StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/mul", "ConstantFolding/StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/concat/values_1_const_axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/Maximum", "op": "Maximum", "input": ["StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/Const", "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/add"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/split", "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/concat/values_1", "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/split:2", "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/concat/axis"], "attr": {"N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/range_1", "op": "Range", "input": ["StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/range_1/start", "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/Maximum", "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/range_1/delta"], "attr": {"Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/Reshape_2/shape", "op": "Pack", "input": ["StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/Maximum", "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/Reshape_2/shape/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/packed_1", "op": "Pack", "input": ["StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/Maximum", "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame_length"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/StridedSlice", "op": "StridedSlice", "input": ["waveform", "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/zeros_like", "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/concat", "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/ones_like"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/range_1", "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/floordiv_2"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/concat_2", "op": "ConcatV2", "input": ["StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/split", "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/packed_1", "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/split:2", "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/concat_2/axis"], "attr": {"N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/StridedSlice", "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/Reshape_2", "op": "Reshape", "input": ["StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/mul_1", "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/Reshape_2/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/Reshape_2", "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/Reshape_3"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/Reshape_1", "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/add_1", "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/strided_slice"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/Reshape_4", "op": "Reshape", "input": ["StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/GatherV2", "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/concat_2"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/mul", "op": "Mul", "input": ["StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/Reshape_4", "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/hann_window/sub_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/rfft/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/mul", "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/rfft/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/rfft", "op": "RFFT", "input": ["StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/rfft/Pad", "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/rfft/fft_length"], "attr": {"Treal": {"type": "DT_FLOAT"}, "Tcomplex": {"type": "DT_COMPLEX64"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/Abs", "op": "ComplexAbs", "input": ["StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/rfft"], "attr": {"Tout": {"type": "DT_FLOAT"}, "T": {"type": "DT_COMPLEX64"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/Abs", "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/MatMul/ReadVariableOp"], "attr": {"adj_x": {"b": false}, "grad_y": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}, "grad_x": {"b": false}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/MatMul", "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/Log", "op": "Log", "input": ["StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/Log", "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/conv1_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/ExpandDims", "StatefulPartitionedCall/vowel_classifier_1/conv1_1/convolution/ReadVariableOp", "StatefulPartitionedCall/vowel_classifier_1/conv1_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/bn1_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/vowel_classifier_1/conv1_1/Relu", "StatefulPartitionedCall/vowel_classifier_1/bn1_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/bn1_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/vowel_classifier_1/bn1_1/batchnorm/mul_1", "StatefulPartitionedCall/vowel_classifier_1/bn1_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/pool1_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/vowel_classifier_1/bn1_1/batchnorm/add_1"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/conv2_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/vowel_classifier_1/pool1_1/MaxPool2d", "StatefulPartitionedCall/vowel_classifier_1/conv2_1/convolution/ReadVariableOp", "StatefulPartitionedCall/vowel_classifier_1/conv2_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/bn2_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/vowel_classifier_1/conv2_1/Relu", "StatefulPartitionedCall/vowel_classifier_1/bn2_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/bn2_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/vowel_classifier_1/bn2_1/batchnorm/mul_1", "StatefulPartitionedCall/vowel_classifier_1/bn2_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/pool2_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/vowel_classifier_1/bn2_1/batchnorm/add_1"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/conv3_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/vowel_classifier_1/pool2_1/MaxPool2d", "StatefulPartitionedCall/vowel_classifier_1/conv3_1/convolution/ReadVariableOp", "StatefulPartitionedCall/vowel_classifier_1/conv3_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/bn3_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/vowel_classifier_1/conv3_1/Relu", "StatefulPartitionedCall/vowel_classifier_1/bn3_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/bn3_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/vowel_classifier_1/bn3_1/batchnorm/mul_1", "StatefulPartitionedCall/vowel_classifier_1/bn3_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/gap_1/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/vowel_classifier_1/bn3_1/batchnorm/add_1", "StatefulPartitionedCall/vowel_classifier_1/gap_1/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/dense1_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/vowel_classifier_1/gap_1/Mean", "StatefulPartitionedCall/vowel_classifier_1/dense1_1/Cast/ReadVariableOp", "StatefulPartitionedCall/vowel_classifier_1/dense1_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/vowel_output_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/vowel_classifier_1/dense1_1/Relu", "StatefulPartitionedCall/vowel_classifier_1/vowel_output_1/Cast/ReadVariableOp", "StatefulPartitionedCall/vowel_classifier_1/vowel_output_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/vowel_output_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/vowel_classifier_1/vowel_output_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/vowel_classifier_1/vowel_output_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 2129}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/zeros_like", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/mul/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/ones_like", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/floordiv_3/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/concat_1/values_1/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/range_1/start", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/range_1/delta", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/floordiv_2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/Reshape_2/shape/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/Reshape_3", "shape": [1, 5], "dtype": "int32"}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/strided_slice", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/Const", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/add/x", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/Reshape/shape_1", "shape": [0], "dtype": "int32"}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame_step", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame_length", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/packed", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/split/split_dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/concat_2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/hann_window/sub_2", "shape": [400], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0, "scale": 0.00392156862745098, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/rfft/Pad/paddings", "shape": [3, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/rfft/fft_length", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/MatMul/ReadVariableOp", "shape": [257, 40], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0, "scale": 0.003901328526291193, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/add/y", "shape": [], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 9.999999974752427e-07, "scale": 1.0, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/vowel_classifier_1/conv1_1/convolution/ReadVariableOp", "shape": [3, 3, 1, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2935027719712725, "scale": 0.0030895028628554998, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/conv1_1/Squeeze", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.4017080674568812, "scale": 0.0018771405021349588, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/bn1_1/batchnorm/mul", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.5062189102172852, "scale": 0.08955133849499272, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/bn1_1/batchnorm/sub", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.1460636400708966, "scale": 0.005116355536030788, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/conv2_1/convolution/ReadVariableOp", "shape": [3, 3, 32, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.6317720448269564, "scale": 0.004897457711836871, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/conv2_1/Squeeze", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5454520150726916, "scale": 0.0026478253158868526, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/bn2_1/batchnorm/mul", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.33725181221961975, "scale": 0.008103546792385626, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/bn2_1/batchnorm/sub", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.8561620834995719, "scale": 0.004390574787177292, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/conv3_1/convolution/ReadVariableOp", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.7922887846535327, "scale": 0.005046425379958807, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/conv3_1/Squeeze", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.33085504559909595, "scale": 0.00196937527142319, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/bn3_1/batchnorm/mul", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.26528629660606384, "scale": 0.03889633311944849, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/bn3_1/batchnorm/sub", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.6822198629379272, "scale": 0.002506329791218627, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/gap_1/Mean/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/vowel_classifier_1/dense1_1/Cast/ReadVariableOp", "shape": [64, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.1185595316045425, "scale": 0.008807555366964901, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/dense1_1/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1896486961958455, "scale": 0.0018412494776295682, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/vowel_output_1/Cast/ReadVariableOp", "shape": [32, 6], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -2.5192171657786653, "scale": 0.014995340272492054, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/vowel_classifier_1/vowel_output_1/BiasAdd/ReadVariableOp", "shape": [6], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -2.0879480838775635, "scale": 0.0069081532020194856, "original_dtype": "float32"}}, {"name": "ConstantFolding/StatefulPartitionedCall/vowel_classifier_1/mel_spectrogram_1/stft/frame/concat/values_1_const_axis", "shape": [], "dtype": "int32"}]}]}